package ru.practicum.shareit.item.repository;

import org.junit.jupiter.api.Test;

class CommentRepositoryTest {
    //todo: Реализовать тесты для слоя репозиториев вашего приложения с использованием аннотации @DataJpaTest.
    // Есть смысл написать тесты для тех репозиториев, которые содержат кастомные запросы.
    // Работа с аннотацией @DataJpaTest не рассматривалась подробно в уроке,
    // поэтому вам предстоит изучить пример самостоятельно, перейдя по ссылке.
    // Ещё больше деталей вы сможете найти в приложенном файле с советами ментора.

    @Test
    void findAllByItem_Id() {
    }
}